#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; COLOUR                   0   xyzw        0     NONE   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; SV_Position              0   xyzw        2      POS   float   xyzw
;
; shader debug name: 73779143a7e5383a14d3bb42deb3d456.pdb
; shader hash: 73779143a7e5383a14d3bb42deb3d456
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer GeometryDataCB
; {
;
;   struct GeometryDataCB
;   {
;
;       struct struct.GeometryData
;       {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !34)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CBindlessExampleVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 26, type: !18, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 19, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 21, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 22, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 23, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !33)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !{!35}
!35 = !DIGlobalVariable(name: "BufferTable", linkageName: "\01?BufferTable@@3PAUByteAddressBuffer@@A", scope: !0, file: !1, line: 9, type: !36, isLocal: false, isDefinition: true, variable: [0 x %struct.ByteAddressBuffer]* @"\01?BufferTable@@3PAUByteAddressBuffer@@A")
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, align: 32, elements: !38)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 30, size: 32, align: 32, elements: !2)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{!"dxc 1.2"}
!43 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CBindlessExampleVS.hlsl", !"#include \22BindlessExample.hlsli\22\0D\0A\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix modelViewProjectMatrix;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b1);\0D\0AByteAddressBuffer BufferTable[] : register(t0, BufferSpace);\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    float3 Pos      : POSITION;\0D\0A    float3 Colour   : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float4 Colour : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(in uint vertexID : SV_VertexID)\0D\0A{\0D\0A    VsOutput output;\0D\0A    \0D\0A    ByteAddressBuffer vertexBuffer = BufferTable[GeometryDataCB.VertexBufferIndex];\0D\0A    Vertex vert = BufferTable[GeometryDataCB.VertexBufferIndex].Load<Vertex>((GeometryDataCB.VertexOffset + vertexID) * sizeof(Vertex));\0D\0A    \0D\0A    output.Position = mul(DrawInfoCB.modelViewProjectMatrix, float4(vert.Pos, 1.0f));\0D\0A    output.TexCoord = vert.TexCoord;\0D\0A    output.Colour = float4(vert.Colour, 1.0f);\0D\0A    \0D\0A    return output;\0D\0A}"}
!44 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc/BindlessExample.hlsli", !"\0D\0A#include \22Defines.hlsli\22\0D\0A\0D\0A#ifndef __BINDLESS_EXAMPLE_HLSLI__\0D\0A#define __BINDLESS_EXAMPLE_HLSLI__\0D\0A\0D\0A\0D\0A\0D\0Astruct GeometryData\0D\0A{\0D\0A    uint IndexOffset;\0D\0A    uint VertexBufferIndex;\0D\0A    uint VertexOffset;\0D\0A    uint AlbedoTextureIndex;\0D\0A};\0D\0A    \0D\0AConstantBuffer<GeometryData> GeometryDataCB : register(b0);\0D\0A\0D\0A#endif"}
!45 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc/Defines.hlsli", !"#ifndef __DEFINES_HLSLI__\0D\0A#define __DEFINES_HLSLI__\0D\0A\0D\0A#define BufferSpace     space100\0D\0A#define Tex2DSpace      space101\0D\0A#define TexCubeSpace    space102\0D\0A\0D\0A#define InvalidDescriptorIndex ~0U\0D\0A\0D\0A\0D\0A#define PI 3.14159265f\0D\0A#endif"}
!46 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CBindlessExampleVS.hlsl"}
!47 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CBindlessExampleVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!48 = !{i32 1, i32 5}
!49 = !{!"vs", i32 6, i32 5}
!50 = !{!51, null, !53, null}
!51 = !{!52}
!52 = !{i32 0, [0 x %struct.ByteAddressBuffer]* undef, !"BufferTable", i32 100, i32 0, i32 -1, i32 11, i32 0, null}
!53 = !{!54, !55}
!54 = !{i32 0, %GeometryDataCB* undef, !"GeometryDataCB", i32 0, i32 0, i32 1, i32 16, null}
!55 = !{i32 1, %dx.alignment.legacy.DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 1, i32 1, i32 64, null}
!56 = !{i32 0, %struct.GeometryData undef, !57, %struct.DrawInfo undef, !62, %struct.ByteAddressBuffer undef, !65, %struct.VsOutput undef, !67, %struct.Vertex undef, !71, %GeometryDataCB undef, !75, %DrawInfoCB undef, !77, %dx.alignment.legacy.struct.DrawInfo undef, !62, %dx.alignment.legacy.DrawInfoCB undef, !77}
!57 = !{i32 16, !58, !59, !60, !61}
!58 = !{i32 6, !"IndexOffset", i32 3, i32 0, i32 7, i32 5}
!59 = !{i32 6, !"VertexBufferIndex", i32 3, i32 4, i32 7, i32 5}
!60 = !{i32 6, !"VertexOffset", i32 3, i32 8, i32 7, i32 5}
!61 = !{i32 6, !"AlbedoTextureIndex", i32 3, i32 12, i32 7, i32 5}
!62 = !{i32 64, !63}
!63 = !{i32 6, !"modelViewProjectMatrix", i32 2, !64, i32 3, i32 0, i32 7, i32 9}
!64 = !{i32 4, i32 4, i32 2}
!65 = !{i32 4, !66}
!66 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!67 = !{i32 48, !68, !69, !70}
!68 = !{i32 6, !"Colour", i32 3, i32 0, i32 4, !"COLOUR", i32 7, i32 9}
!69 = !{i32 6, !"TexCoord", i32 3, i32 16, i32 4, !"TEXCOORD", i32 7, i32 9}
!70 = !{i32 6, !"Position", i32 3, i32 32, i32 4, !"SV_POSITION", i32 7, i32 9}
!71 = !{i32 40, !72, !73, !74}
!72 = !{i32 6, !"Pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!73 = !{i32 6, !"Colour", i32 3, i32 16, i32 4, !"COLOUR", i32 7, i32 9}
!74 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!75 = !{i32 16, !76}
!76 = !{i32 6, !"GeometryDataCB", i32 3, i32 0}
!77 = !{i32 64, !78}
!78 = !{i32 6, !"DrawInfoCB", i32 3, i32 0}
!79 = !{i32 1, void ()* @main, !80}
!80 = !{!81}
!81 = !{i32 0, !2, !2}
!82 = !{[3 x i32] [i32 1, i32 12, i32 3895]}
!83 = !{void ()* @main, !"main", !84, !50, !95}
!84 = !{!85, !89, null}
!85 = !{!86}
!86 = !{i32 0, !"SV_VertexID", i8 5, i8 1, !87, i8 0, i32 1, i8 1, i32 0, i8 0, !88}
!87 = !{i32 0}
!88 = !{i32 3, i32 1}
!89 = !{!90, !92, !94}
!90 = !{i32 0, !"COLOUR", i8 9, i8 0, !87, i8 2, i32 1, i8 4, i32 0, i8 0, !91}
!91 = !{i32 3, i32 15}
!92 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !87, i8 2, i32 1, i8 2, i32 1, i8 0, !93}
!93 = !{i32 3, i32 3}
!94 = !{i32 2, !"SV_Position", i8 9, i8 3, !87, i8 4, i32 1, i8 4, i32 2, i8 0, !91}
!95 = !{i32 0, i64 17}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vertexID", arg: 1, scope: !17, file: !1, line: 26, type: !32)
!97 = !DIExpression()
!98 = !DILocation(line: 26, column: 23, scope: !17)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vert", scope: !17, file: !1, line: 31, type: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !1, line: 11, size: 256, align: 32, elements: !101)
!101 = !{!102, !111, !112}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !100, file: !1, line: 13, baseType: !103, size: 96, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !105, templateParams: !109)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !104, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !104, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !104, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!109 = !{!13, !110}
!110 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !100, file: !1, line: 14, baseType: !103, size: 96, align: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !100, file: !1, line: 15, baseType: !24, size: 64, align: 32, offset: 192)
!113 = !DIExpression(DW_OP_bit_piece, 0, 96)
!114 = !DILocation(line: 31, column: 12, scope: !17)
!115 = !DIExpression(DW_OP_bit_piece, 96, 96)
!116 = !DIExpression(DW_OP_bit_piece, 192, 64)
!117 = !DILocation(line: 31, column: 46, scope: !17)
!118 = !DILocation(line: 31, column: 94, scope: !17)
!119 = !DILocation(line: 31, column: 109, scope: !17)
!120 = !DILocation(line: 31, column: 107, scope: !17)
!121 = !DILocation(line: 31, column: 119, scope: !17)
!122 = !DILocation(line: 31, column: 19, scope: !17)
!123 = !DILocation(line: 33, column: 74, scope: !17)
!124 = !DILocation(line: 33, column: 38, scope: !17)
!125 = !DILocation(line: 33, column: 23, scope: !17)
!126 = !DILocation(line: 33, column: 21, scope: !17)
!127 = !DILocation(line: 34, column: 28, scope: !17)
!128 = !DILocation(line: 34, column: 21, scope: !17)
!129 = !DILocation(line: 35, column: 33, scope: !17)
!130 = !DILocation(line: 35, column: 19, scope: !17)
!131 = !DILocation(line: 37, column: 5, scope: !17)

#endif

const unsigned char gBindlessExampleVS[] = {
  0x44, 0x58, 0x42, 0x43, 0xd5, 0xbf, 0xc0, 0x8e, 0xeb, 0x9f, 0x0b, 0x18,
  0x5b, 0x23, 0x2d, 0x3b, 0xaa, 0x22, 0xef, 0xfe, 0x01, 0x00, 0x00, 0x00,
  0xe4, 0x30, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0x90, 0x00, 0x00, 0x00, 0x1c, 0x01, 0x00, 0x00,
  0xf8, 0x01, 0x00, 0x00, 0x20, 0x1d, 0x00, 0x00, 0x98, 0x26, 0x00, 0x00,
  0xcc, 0x26, 0x00, 0x00, 0xe8, 0x26, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x49, 0x53, 0x47, 0x31, 0x34, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x28, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x06, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x53, 0x56, 0x5f, 0x56, 0x65, 0x72, 0x74, 0x65, 0x78, 0x49, 0x44, 0x00,
  0x4f, 0x53, 0x47, 0x31, 0x84, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x68, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x0f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x6f, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x03, 0x0c, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x78, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x0f, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x43, 0x4f, 0x4c, 0x4f, 0x55, 0x52, 0x00, 0x54,
  0x45, 0x58, 0x43, 0x4f, 0x4f, 0x52, 0x44, 0x00, 0x53, 0x56, 0x5f, 0x50,
  0x6f, 0x73, 0x69, 0x74, 0x69, 0x6f, 0x6e, 0x00, 0x50, 0x53, 0x56, 0x30,
  0xd4, 0x00, 0x00, 0x00, 0x24, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xff, 0x01, 0x00, 0x00, 0x00,
  0x01, 0x03, 0x00, 0x01, 0x03, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x04, 0x00, 0x00, 0x00, 0x64, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0xff, 0xff, 0xff, 0xff, 0x14, 0x00, 0x00, 0x00, 0x00, 0x43, 0x4f, 0x4c,
  0x4f, 0x55, 0x52, 0x00, 0x54, 0x45, 0x58, 0x43, 0x4f, 0x4f, 0x52, 0x44,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x41, 0x01, 0x01, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x44, 0x00, 0x03, 0x02, 0x00, 0x00,
