#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TANGENT                  0   xyz         4     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 4de4e65333c1f7398a22f3e4acee3125.pdb
; shader hash: 4de4e65333c1f7398a22f3e4acee3125
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
; TANGENT                  0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !73)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5Cdiffered_shaders\5CForwardPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !22, !8, !30, !37}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 96, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 96, size: 288, align: 32, elements: !6, templateParams: !17)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!17 = !{!18, !19, !21}
!18 = !DITemplateTypeParameter(name: "element", type: !8)
!19 = !DITemplateValueParameter(name: "row_count", type: !20, value: i32 3)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DITemplateValueParameter(name: "col_count", type: !20, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!18, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !32, templateParams: !35)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !{!18, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 2)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !39, templateParams: !44)
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !38, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !{!18, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !20, value: i32 4)
!46 = !{!47, !57, !61, !64, !67, !70}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 64, type: !48, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{!37, !50}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 52, size: 480, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !50, file: !1, line: 54, baseType: !22, size: 96, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !50, file: !1, line: 55, baseType: !37, size: 128, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !50, file: !1, line: 56, baseType: !30, size: 64, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !50, file: !1, line: 57, baseType: !22, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TangentWS", scope: !50, file: !1, line: 58, baseType: !22, size: 96, align: 32, offset: 384)
!57 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !58, file: !58, line: 16, type: !59, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5Cdiffered_shaders/../BRDFFunctions.hlsli", directory: "")
!59 = !DISubroutineType(types: !60)
!60 = !{!8, !22, !22, !8}
!61 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !58, file: !58, line: 46, type: !62, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!8, !22, !22, !22, !8}
!64 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !58, file: !58, line: 34, type: !65, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!8, !8, !8}
!67 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !58, file: !58, line: 62, type: !68, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!22, !8, !22}
!70 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !58, file: !58, line: 67, type: !71, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!22, !8, !22, !8}
!73 = !{!74, !76, !77, !85, !92, !95, !97, !98, !99}
!74 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 62, type: !75, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!76 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 63, type: !75, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!77 = !DIGlobalVariable(name: "OmniLightsSB", linkageName: "\01?OmniLightsSB@@3V?$StructuredBuffer@UOmniLight@@@@A", scope: !0, file: !1, line: 44, type: !78, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<OmniLight>"* @"\01?OmniLightsSB@@3V?$StructuredBuffer@UOmniLight@@@@A")
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<OmniLight>", file: !1, line: 44, size: 256, align: 32, elements: !2, templateParams: !79)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "element", type: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "OmniLight", file: !1, line: 38, size: 256, align: 32, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !81, file: !1, line: 40, baseType: !37, size: 128, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !81, file: !1, line: 41, baseType: !37, size: 128, align: 32, offset: 128)
!85 = !DIGlobalVariable(name: "Texture2DTable", linkageName: "\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 46, type: !86, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 160, align: 32, elements: !90)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 46, size: 160, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !38)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIGlobalVariable(name: "TextureCubeTable", linkageName: "\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 47, type: !93, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, align: 32, elements: !90)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 47, size: 128, align: 32, elements: !2, templateParams: !88)
!95 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !1, line: 49, type: !96, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerDefault@@3USamplerState@@A")
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 49, size: 32, align: 32, elements: !2)
!97 = !DIGlobalVariable(name: "SamplerBrdf", linkageName: "\01?SamplerBrdf@@3USamplerState@@A", scope: !0, file: !1, line: 50, type: !96, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerBrdf@@3USamplerState@@A")
!98 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 62, type: !75, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 63, type: !75, isLocal: true, isDefinition: true)
!100 = !{i32 2, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{!"dxc 1.2"}
