#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; COLOR                    0   xyzw        0     NONE   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; SV_Position              0   xyzw        2      POS   float   xyzw
;
; shader debug name: b5341ed81e28a7437a85e6660093c84d.pdb
; shader hash: b5341ed81e28a7437a85e6660093c84d
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; COLOR                    0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CImGuiVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 26, type: !18, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 18, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 20, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 21, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 22, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 11, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 13, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 14, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !32, file: !1, line: 15, baseType: !4, size: 128, align: 32, offset: 128)
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{!"dxc 1.2"}
!40 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CImGuiVS.hlsl", !"\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix mvp;\0D\0A    uint textureIndex;\0D\0A    float3 _padding;\0D\0A};\0D\0A    \0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float2 Position : POSITION;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 Colour : COLOR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Position : SV_Position;\0D\0A};\0D\0A\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    output.Position = mul(DrawInfoCB.mvp, float4(input.Position.xy, 0.f, 1.f));\0D\0A    output.Colour = input.Color;\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    \0D\0A    return output;\0D\0A}"}
!41 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CImGuiVS.hlsl"}
!42 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CImGuiVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!43 = !{i32 1, i32 5}
!44 = !{!"vs", i32 6, i32 5}
!45 = !{null, null, !46, null}
!46 = !{!47}
!47 = !{i32 0, %dx.alignment.legacy.DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 0, i32 1, i32 80, null}
!48 = !{i32 0, %struct.DrawInfo undef, !49, %struct.VSOutput undef, !54, %struct.VSInput undef, !58, %DrawInfoCB undef, !62, %dx.alignment.legacy.struct.DrawInfo undef, !49, %dx.alignment.legacy.DrawInfoCB undef, !62}
!49 = !{i32 80, !50, !52, !53}
!50 = !{i32 6, !"mvp", i32 2, !51, i32 3, i32 0, i32 7, i32 9}
!51 = !{i32 4, i32 4, i32 2}
!52 = !{i32 6, !"textureIndex", i32 3, i32 64, i32 7, i32 5}
!53 = !{i32 6, !"_padding", i32 3, i32 68, i32 7, i32 9}
!54 = !{i32 48, !55, !56, !57}
!55 = !{i32 6, !"Colour", i32 3, i32 0, i32 4, !"COLOR", i32 7, i32 9}
!56 = !{i32 6, !"TexCoord", i32 3, i32 16, i32 4, !"TEXCOORD", i32 7, i32 9}
!57 = !{i32 6, !"Position", i32 3, i32 32, i32 4, !"SV_Position", i32 7, i32 9}
!58 = !{i32 32, !59, !60, !61}
!59 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!60 = !{i32 6, !"TexCoord", i32 3, i32 8, i32 4, !"TEXCOORD", i32 7, i32 9}
!61 = !{i32 6, !"Color", i32 3, i32 16, i32 4, !"COLOR", i32 7, i32 9}
!62 = !{i32 80, !63}
!63 = !{i32 6, !"DrawInfoCB", i32 3, i32 0}
!64 = !{i32 1, void ()* @main, !65}
!65 = !{!66}
!66 = !{i32 0, !2, !2}
!67 = !{[14 x i32] [i32 12, i32 12, i32 3840, i32 3840, i32 0, i32 0, i32 48, i32 48, i32 0, i32 0, i32 15, i32 15, i32 15, i32 15]}
!68 = !{void ()* @main, !"main", !69, !45, !81}
!69 = !{!70, !77, null}
!70 = !{!71, !74, !75}
!71 = !{i32 0, !"POSITION", i8 9, i8 0, !72, i8 0, i32 1, i8 2, i32 0, i8 0, !73}
!72 = !{i32 0}
!73 = !{i32 3, i32 3}
!74 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !72, i8 0, i32 1, i8 2, i32 1, i8 0, !73}
!75 = !{i32 2, !"COLOR", i8 9, i8 0, !72, i8 0, i32 1, i8 4, i32 2, i8 0, !76}
!76 = !{i32 3, i32 15}
!77 = !{!78, !79, !80}
!78 = !{i32 0, !"COLOR", i8 9, i8 0, !72, i8 2, i32 1, i8 4, i32 0, i8 0, !76}
!79 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !72, i8 2, i32 1, i8 2, i32 1, i8 0, !73}
!80 = !{i32 2, !"SV_Position", i8 9, i8 3, !72, i8 4, i32 1, i8 4, i32 2, i8 0, !76}
!81 = !{i32 0, i64 1}
!82 = !DILocation(line: 26, column: 23, scope: !17)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 26, type: !32)
!84 = !DIExpression(DW_OP_bit_piece, 128, 128)
!85 = !DIExpression(DW_OP_bit_piece, 64, 64)
!86 = !DIExpression(DW_OP_bit_piece, 0, 64)
!87 = !DILocation(line: 29, column: 50, scope: !17)
!88 = !DILocation(line: 29, column: 38, scope: !17)
!89 = !DILocation(line: 29, column: 23, scope: !17)
