#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOUR                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; SV_Position              0   xyzw        4      POS   float   xyzw
;
; shader debug name: bcf243bfb0e50caa48b7b5d002d09d61.pdb
; shader hash: bcf243bfb0e50caa48b7b5d002d09d61
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; COLOUR                   0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 35, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 35, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 28, type: !33, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !57}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 19, size: 512, align: 32, elements: !36)
!36 = !{!37, !46, !47, !55, !56}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 21, baseType: !38, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 22, baseType: !4, size: 128, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 23, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 24, baseType: !38, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 25, baseType: !4, size: 128, align: 32, offset: 384)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 11, size: 352, align: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !57, file: !1, line: 13, baseType: !38, size: 96, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !57, file: !1, line: 14, baseType: !38, size: 96, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !57, file: !1, line: 15, baseType: !38, size: 96, align: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !57, file: !1, line: 16, baseType: !48, size: 64, align: 32, offset: 288)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"dxc 1.2"}
!66 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", !"\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix WorldMatrix;\0D\0A    matrix ModelViewProjectMatrix;\0D\0A    float3 CameraPosition;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Pos : POSITION;\0D\0A    float3 Normal : NORMAL;\0D\0A    float3 Colour   : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float3 NormalWS : NORMAL;\0D\0A    float4 Colour : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float3 PositionWS : Position;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(VSInput input)\0D\0A{\0D\0A    VsOutput output;\0D\0A \0D\0A    float4 modelPosition = float4(input.Pos, 1.0f);\0D\0A    output.PositionWS = mul(modelPosition, DrawInfoCB.WorldMatrix);\0D\0A    output.Position = mul(DrawInfoCB.ModelViewProjectMatrix, modelPosition);\0D\0A    output.NormalWS = mul(input.Normal, (float3x3) DrawInfoCB.WorldMatrix);\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    output.Colour = float4(input.Colour, 1.0f);\0D\0A    \0D\0A    return output;\0D\0A}"}
!67 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl"}
!68 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CPbrDemoVS.cso", !"/Zi"}
!69 = !{i32 1, i32 5}
!70 = !{!"vs", i32 6, i32 5}
!71 = !{null, null, !72, null}
!72 = !{!73}
!73 = !{i32 0, %dx.alignment.legacy.DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 0, i32 1, i32 140, null}
!74 = !{i32 0, %struct.DrawInfo undef, !75, %struct.VsOutput undef, !80, %struct.VSInput undef, !86, %DrawInfoCB undef, !91, %dx.alignment.legacy.struct.DrawInfo undef, !75, %dx.alignment.legacy.DrawInfoCB undef, !91}
!75 = !{i32 140, !76, !78, !79}
!76 = !{i32 6, !"WorldMatrix", i32 2, !77, i32 3, i32 0, i32 7, i32 9}
!77 = !{i32 4, i32 4, i32 2}
!78 = !{i32 6, !"ModelViewProjectMatrix", i32 2, !77, i32 3, i32 64, i32 7, i32 9}
!79 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!80 = !{i32 80, !81, !82, !83, !84, !85}
!81 = !{i32 6, !"NormalWS", i32 3, i32 0, i32 4, !"NORMAL", i32 7, i32 9}
!82 = !{i32 6, !"Colour", i32 3, i32 16, i32 4, !"COLOUR", i32 7, i32 9}
!83 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!84 = !{i32 6, !"PositionWS", i32 3, i32 48, i32 4, !"Position", i32 7, i32 9}
!85 = !{i32 6, !"Position", i32 3, i32 64, i32 4, !"SV_POSITION", i32 7, i32 9}
!86 = !{i32 56, !87, !88, !89, !90}
!87 = !{i32 6, !"Pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!88 = !{i32 6, !"Normal", i32 3, i32 16, i32 4, !"NORMAL", i32 7, i32 9}
!89 = !{i32 6, !"Colour", i32 3, i32 32, i32 4, !"COLOUR", i32 7, i32 9}
!90 = !{i32 6, !"TexCoord", i32 3, i32 48, i32 4, !"TEXCOORD", i32 7, i32 9}
!91 = !{i32 140, !92}
!92 = !{i32 6, !"DrawInfoCB", i32 3, i32 0}
!93 = !{i32 1, void ()* @main, !94}
!94 = !{!95}
!95 = !{i32 0, !2, !2}
!96 = !{[16 x i32] [i32 14, i32 20, i32 1011712, i32 1011712, i32 1011712, i32 0, i32 7, i32 7, i32 7, i32 0, i32 16, i32 32, i32 64, i32 0, i32 256, i32 512]}
!97 = !{void ()* @main, !"main", !98, !71, null}
!98 = !{!99, !107, null}
!99 = !{!100, !103, !104, !105}
!100 = !{i32 0, !"POSITION", i8 9, i8 0, !101, i8 0, i32 1, i8 3, i32 0, i8 0, !102}
!101 = !{i32 0}
!102 = !{i32 3, i32 7}
!103 = !{i32 1, !"NORMAL", i8 9, i8 0, !101, i8 0, i32 1, i8 3, i32 1, i8 0, !102}
!104 = !{i32 2, !"COLOUR", i8 9, i8 0, !101, i8 0, i32 1, i8 3, i32 2, i8 0, !102}
!105 = !{i32 3, !"TEXCOORD", i8 9, i8 0, !101, i8 0, i32 1, i8 2, i32 3, i8 0, !106}
!106 = !{i32 3, i32 3}
