#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TBN                      0   xyz         4     NONE   float   xyz 
; TBN                      1   xyz         5     NONE   float   xyz 
; TBN                      2   xyz         6     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: b80dd2d20cd625c52fa5f296e9532a20.pdb
; shader hash: b80dd2d20cd625c52fa5f296e9532a20
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !73)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!31 = !{!32, !57, !61, !64, !67, !70}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 54, type: !33, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!22, !35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 42, size: 672, align: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 44, baseType: !4, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 45, baseType: !22, size: 128, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 46, baseType: !15, size: 64, align: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 47, baseType: !4, size: 96, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "TBN", scope: !35, file: !1, line: 48, baseType: !42, size: 288, align: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, size: 288, align: 32, elements: !44, templateParams: !54)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !43, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !43, file: !1, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!54 = !{!12, !55, !56}
!55 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!56 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!57 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !58, file: !58, line: 16, type: !59, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!59 = !DISubroutineType(types: !60)
!60 = !{!8, !4, !4, !8}
!61 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !58, file: !58, line: 46, type: !62, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!8, !4, !4, !4, !8}
!64 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !58, file: !58, line: 34, type: !65, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!8, !8, !8}
!67 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !58, file: !58, line: 62, type: !68, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!4, !8, !4}
!70 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !58, file: !58, line: 67, type: !71, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!4, !8, !4, !8}
!73 = !{!74, !76, !77, !84, !87, !89, !90, !91}
!74 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 52, type: !75, isLocal: true, isDefinition: true, variable: float 0x3FA47AE140000000)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!76 = !DIGlobalVariable(name: "MaxReflectionLod", scope: !0, file: !1, line: 53, type: !75, isLocal: true, isDefinition: true, variable: float 7.000000e+00)
!77 = !DIGlobalVariable(name: "Texture2DTable", linkageName: "\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !78, isLocal: false, isDefinition: true, variable: [0 x %"class.Texture2D<vector<float, 4> >"]* @"\01?Texture2DTable@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 160, align: 32, elements: !82)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 36, size: 160, align: 32, elements: !2, templateParams: !80)
!80 = !{!81}
!81 = !DITemplateTypeParameter(name: "element", type: !23)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIGlobalVariable(name: "TextureCubeTable", linkageName: "\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 37, type: !85, isLocal: false, isDefinition: true, variable: [0 x %"class.TextureCube<vector<float, 4> >"]* @"\01?TextureCubeTable@@3PAV?$TextureCube@V?$vector@M$03@@@@A")
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 32, elements: !82)
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 37, size: 128, align: 32, elements: !2, templateParams: !80)
!87 = !DIGlobalVariable(name: "SamplerDefault", linkageName: "\01?SamplerDefault@@3USamplerState@@A", scope: !0, file: !1, line: 39, type: !88, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?SamplerDefault@@3USamplerState@@A")
