#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOUR                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; SV_Position              0   xyzw        4      POS   float   xyzw
;
; shader debug name: b14a6533eb7c115803d39ac0f469f83d.pdb
; shader hash: b14a6533eb7c115803d39ac0f469f83d
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; COLOUR                   0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 28, type: !18, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !42}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 19, size: 512, align: 32, elements: !21)
!21 = !{!22, !31, !32, !40, !41}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !20, file: !1, line: 21, baseType: !23, size: 96, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 22, baseType: !4, size: 128, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 23, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !20, file: !1, line: 24, baseType: !23, size: 96, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 25, baseType: !4, size: 128, align: 32, offset: 384)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 11, size: 352, align: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !42, file: !1, line: 13, baseType: !23, size: 96, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !42, file: !1, line: 14, baseType: !23, size: 96, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !42, file: !1, line: 15, baseType: !23, size: 96, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !42, file: !1, line: 16, baseType: !33, size: 64, align: 32, offset: 288)
!48 = !{i32 2, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{!"dxc 1.2"}
!51 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", !"\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix WorldMatrix;\0D\0A    matrix ModelViewProjectMatrix;\0D\0A    float3 CameraPosition;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Pos : POSITION;\0D\0A    float3 Normal : NORMAL;\0D\0A    float3 Colour   : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float3 Normal : NORMAL;\0D\0A    float4 Colour : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float3 WorldPosition : Position;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(VSInput input)\0D\0A{\0D\0A    VsOutput output;\0D\0A \0D\0A    float4 modelPosition = float4(input.Pos, 1.0f);\0D\0A    output.WorldPosition = mul(DrawInfoCB.WorldMatrix, modelPosition);\0D\0A    output.Position = mul(DrawInfoCB.ModelViewProjectMatrix, modelPosition);\0D\0A    output.Normal = input.Normal;\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    output.Colour = float4(input.Colour, 1.0f);\0D\0A    \0D\0A    return output;\0D\0A}"}
!52 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl"}
!53 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CPbrDemoVS.cso", !"/Zi"}
!54 = !{i32 1, i32 5}
!55 = !{!"vs", i32 6, i32 5}
!56 = !{null, null, !57, null}
!57 = !{!58}
!58 = !{i32 0, %dx.alignment.legacy.DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 0, i32 1, i32 140, null}
!59 = !{i32 0, %struct.DrawInfo undef, !60, %struct.VsOutput undef, !65, %struct.VSInput undef, !71, %DrawInfoCB undef, !76, %dx.alignment.legacy.struct.DrawInfo undef, !60, %dx.alignment.legacy.DrawInfoCB undef, !76}
!60 = !{i32 140, !61, !63, !64}
!61 = !{i32 6, !"WorldMatrix", i32 2, !62, i32 3, i32 0, i32 7, i32 9}
!62 = !{i32 4, i32 4, i32 2}
!63 = !{i32 6, !"ModelViewProjectMatrix", i32 2, !62, i32 3, i32 64, i32 7, i32 9}
!64 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!65 = !{i32 80, !66, !67, !68, !69, !70}
!66 = !{i32 6, !"Normal", i32 3, i32 0, i32 4, !"NORMAL", i32 7, i32 9}
!67 = !{i32 6, !"Colour", i32 3, i32 16, i32 4, !"COLOUR", i32 7, i32 9}
!68 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!69 = !{i32 6, !"WorldPosition", i32 3, i32 48, i32 4, !"Position", i32 7, i32 9}
!70 = !{i32 6, !"Position", i32 3, i32 64, i32 4, !"SV_POSITION", i32 7, i32 9}
!71 = !{i32 56, !72, !73, !74, !75}
!72 = !{i32 6, !"Pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!73 = !{i32 6, !"Normal", i32 3, i32 16, i32 4, !"NORMAL", i32 7, i32 9}
!74 = !{i32 6, !"Colour", i32 3, i32 32, i32 4, !"COLOUR", i32 7, i32 9}
!75 = !{i32 6, !"TexCoord", i32 3, i32 48, i32 4, !"TEXCOORD", i32 7, i32 9}
!76 = !{i32 140, !77}
!77 = !{i32 6, !"DrawInfoCB", i32 3, i32 0}
!78 = !{i32 1, void ()* @main, !79}
!79 = !{!80}
!80 = !{i32 0, !2, !2}
!81 = !{[16 x i32] [i32 14, i32 20, i32 1011712, i32 1011712, i32 1011712, i32 0, i32 1, i32 2, i32 4, i32 0, i32 16, i32 32, i32 64, i32 0, i32 256, i32 512]}
!82 = !{void ()* @main, !"main", !83, !56, null}
!83 = !{!84, !92, null}
!84 = !{!85, !88, !89, !90}
!85 = !{i32 0, !"POSITION", i8 9, i8 0, !86, i8 0, i32 1, i8 3, i32 0, i8 0, !87}
!86 = !{i32 0}
!87 = !{i32 3, i32 7}
!88 = !{i32 1, !"NORMAL", i8 9, i8 0, !86, i8 0, i32 1, i8 3, i32 1, i8 0, !87}
!89 = !{i32 2, !"COLOUR", i8 9, i8 0, !86, i8 0, i32 1, i8 3, i32 2, i8 0, !87}
!90 = !{i32 3, !"TEXCOORD", i8 9, i8 0, !86, i8 0, i32 1, i8 2, i32 3, i8 0, !91}
!91 = !{i32 3, i32 3}
!92 = !{!93, !94, !96, !97, !98}
