#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOUR                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TANGENT                  0   xyzw        4     NONE   float   xyzw
; BITANGENT                0   xyzw        5     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; Position                 0   xyz         3     NONE   float   xyz 
; TBN                      0   xyz         4     NONE   float   xyz 
; TBN                      1   xyz         5     NONE   float   xyz 
; TBN                      2   xyz         6     NONE   float   xyz 
; SV_Position              0   xyzw        7      POS   float   xyzw
;
; shader debug name: 2fb7bff17aed2c6e88c7d48deb562907.pdb
; shader hash: 2fb7bff17aed2c6e88c7d48deb562907
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !66)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 62, type: !33, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !58}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 52, size: 800, align: 32, elements: !36)
!36 = !{!37, !46, !47, !55, !56, !57}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !35, file: !1, line: 54, baseType: !38, size: 96, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !35, file: !1, line: 55, baseType: !4, size: 128, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !35, file: !1, line: 56, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !35, file: !1, line: 57, baseType: !38, size: 96, align: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "TBN", scope: !35, file: !1, line: 58, baseType: !16, size: 288, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !35, file: !1, line: 59, baseType: !4, size: 128, align: 32, offset: 672)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 42, size: 608, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !58, file: !1, line: 44, baseType: !38, size: 96, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !58, file: !1, line: 45, baseType: !38, size: 96, align: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !58, file: !1, line: 46, baseType: !38, size: 96, align: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !58, file: !1, line: 47, baseType: !48, size: 64, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Tangent", scope: !58, file: !1, line: 48, baseType: !4, size: 128, align: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "BiTangent", scope: !58, file: !1, line: 49, baseType: !4, size: 128, align: 32, offset: 480)
!66 = !{!67}
!67 = !DIGlobalVariable(name: "InstanceSB", linkageName: "\01?InstanceSB@@3V?$StructuredBuffer@UInstanceInfo@@@@A", scope: !0, file: !1, line: 40, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceInfo>", file: !1, line: 40, size: 512, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "element", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceInfo", file: !1, line: 35, size: 512, align: 32, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Transform", scope: !71, file: !1, line: 37, baseType: !74, size: 512, align: 32)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 66, size: 512, align: 32, elements: !75, templateParams: !92)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !74, file: !1, line: 66, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!92 = !{!13, !93, !94}
!93 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!94 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"dxc 1.2"}
!98 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl", !"\0D\0A#define INSTANCED_FLAG 0x01\0D\0A\0D\0Astruct DrawInfo\0D\0A{\0D\0A    uint InstanceIndex;\0D\0A    \0D\0A    float3 Albedo;\0D\0A    float Metallic;\0D\0A    float Roughness;\0D\0A    float Ao;\0D\0A\0D\0A    uint AlbedoTexIndex;\0D\0A    uint NormalTexIndex;\0D\0A    uint MetallicTexIndex;\0D\0A    uint RoughnessTexIndex;\0D\0A    uint AoTexIndex;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b0);\0D\0A\0D\0Astruct SceneInfo\0D\0A{\0D\0A    matrix ViewProjection;\0D\0A    float3 CameraPosition;\0D\0A    float3 SunDirection;\0D\0A    float3 SunColour;\0D\0A    uint IrradianceMapTexIndex;\0D\0A    uint PreFilteredEnvMapTexIndex;\0D\0A    uint BrdfLUTTexIndex;\0D\0A};\0D\0A\0D\0AConstantBuffer<SceneInfo> SceneInfoCB : register(b1);\0D\0A\0D\0Astruct InstanceInfo\0D\0A{\0D\0A    matrix Transform;\0D\0A};\0D\0A\0D\0AStructuredBuffer<InstanceInfo> InstanceSB : register(t0);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Pos : POSITION;\0D\0A    float3 Normal : NORMAL;\0D\0A    float3 Colour   : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Tangent : TANGENT;\0D\0A    float4 BiTangent : BITANGENT;\0D\0A};\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float3 NormalWS     : NORMAL;\0D\0A    float4 Colour       : COLOUR;\0D\0A    float2 TexCoord     : TEXCOORD;\0D\0A    float3 PositionWS   : Position;\0D\0A    float3x3 TBN          : TBN;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(VSInput input)\0D\0A{\0D\0A    VsOutput output;\0D\0A    \0D\0A    matrix worldMatrix = InstanceSB[DrawInfoCB.InstanceIndex].Transform;\0D\0A    \0D\0A    float4 modelPosition = float4(input.Pos, 1.0f);\0D\0A    output.PositionWS = mul(modelPosition, worldMatrix).xyz;\0D\0A    output.Position = mul(float4(output.PositionWS, 1.0f), SceneInfoCB.ViewProjection);\0D\0A    output.NormalWS = mul(input.Normal, (float3x3)worldMatrix);\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    output.Colour = float4(input.Colour, 1.0f);\0D\0A    \0D\0A    float3 TangentWS = mul(input.Tangent.xyz, (float3x3) worldMatrix);\0D\0A    float3 BiTangentWS = mul(input.BiTangent.xyz, (float3x3) worldMatrix);\0D\0A    \0D\0A    // Calculate TBN Matrix\0D\0A    output.TBN = float3x3(normalize(TangentWS), normalize(BiTangentWS), normalize(output.NormalWS));\0D\0A    output.TBN = transpose(output.TBN);\0D\0A    return output;\0D\0A}"}
!99 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoVS.hlsl"}
!100 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CPbrDemoVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!101 = !{i32 1, i32 5}
!102 = !{!"vs", i32 6, i32 5}
!103 = !{!104, null, !107, null}
!104 = !{!105}
!105 = !{i32 0, %"dx.alignment.legacy.class.StructuredBuffer<InstanceInfo>"* undef, !"InstanceSB", i32 0, i32 0, i32 1, i32 12, i32 0, !106}
!106 = !{i32 1, i32 64}
!107 = !{!108, !109}
!108 = !{i32 0, %DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 0, i32 1, i32 48, null}
!109 = !{i32 1, %dx.alignment.legacy.SceneInfoCB* undef, !"SceneInfoCB", i32 0, i32 1, i32 1, i32 120, null}
