#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; NORMAL                   0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyzw        1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
; Position                 0   xyz         3     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 6b65bbd745a15f5c71215b662a1819ac.pdb
; shader hash: 6b65bbd745a15f5c71215b662a1819ac
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; NORMAL                   0                 linear       
; COLOUR                   0                 linear       
; TEXCOORD                 0                 linear       
; Position                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer DrawInfoCB

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !54)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !{!25, !41, !45, !48, !51}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 39, type: !26, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{!15, !28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 28, size: 384, align: 32, elements: !29)
!29 = !{!30, !31, !32, !40}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "NormalWS", scope: !28, file: !1, line: 30, baseType: !4, size: 96, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !28, file: !1, line: 31, baseType: !15, size: 128, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !1, line: 32, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!12, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !28, file: !1, line: 33, baseType: !4, size: 96, align: 32, offset: 288)
!41 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !42, file: !42, line: 62, type: !43, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc/BRDFFunctions.hlsli", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!4, !8, !4}
!45 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !42, file: !42, line: 16, type: !46, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!8, !4, !4, !8}
!48 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !42, file: !42, line: 46, type: !49, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!8, !4, !4, !4, !8}
!51 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !42, file: !42, line: 34, type: !52, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!8, !8, !8}
!54 = !{!55, !57, !59, !61}
!55 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !1, line: 37, type: !56, isLocal: true, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIGlobalVariable(name: "Fdielectric.0", linkageName: "Fdielectric.0", scope: !0, file: !1, line: 37, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !56, size: 32, align: 4)
!59 = !DIGlobalVariable(name: "Fdielectric.1", linkageName: "Fdielectric.1", scope: !0, file: !1, line: 37, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !56, size: 32, align: 4, offset: 32)
!61 = !DIGlobalVariable(name: "Fdielectric.2", linkageName: "Fdielectric.2", scope: !0, file: !1, line: 37, type: !62, isLocal: false, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !56, size: 32, align: 4, offset: 64)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{!"dxc 1.2"}
!66 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CPbrDemoPS.hlsl", !"#include \22BRDFFunctions.hlsli\22\0D\0A\0D\0A\0D\0A// -- Const buffers ---\0D\0A\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix WorldMatrix;\0D\0A    matrix ModelViewProjectMatrix;\0D\0A    float3 CameraPosition;\0D\0A    \0D\0A    float3 SunDirection;\0D\0A    float3 SunColour;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b0);\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 Albedo;\0D\0A    float Metallic;\0D\0A    float Roughness;\0D\0A    float Ao;\0D\0A};\0D\0A    \0D\0AConstantBuffer<Material> MaterialCB : register(b1);\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A    float3 NormalWS : NORMAL;\0D\0A    float4 Colour : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float3 PositionWS : Position;\0D\0A};\0D\0A    \0D\0A// Constant normal incidence Fresnel factor for all dielectrics.\0D\0Astatic const float3 Fdielectric = 0.04;\0D\0A\0D\0Afloat4 main(PSInput input) : SV_Target\0D\0A{\0D\0A    // -- Collect Material Data ---\0D\0A    float3 albedo = MaterialCB.Albedo;\0D\0A    float metallic = MaterialCB.Metallic;\0D\0A    float roughness = MaterialCB.Roughness;\0D\0A    float ao = MaterialCB.Ao;\0D\0A    // -- End Material Collection ---\0D\0A    \0D\0A    float3 N = normalize(input.NormalWS);\0D\0A    float3 V = normalize(DrawInfoCB.CameraPosition - input.PositionWS);\0D\0A        \0D\0A    // Linear Interpolate the value against the abledo as matallic\0D\0A    // surfaces reflect their colour.\0D\0A    float3 F0 = lerp(0.04, albedo, metallic);\0D\0A    \0D\0A    float3 Lo = float3(0.0f, 0.0f, 0.0f);\0D\0A    \0D\0A    // -- Iterate over lights here\0D\0A    // If this is a point light, calculate vector from light to World Pos\0D\0A    float3 L = normalize(DrawInfoCB.SunDirection);\0D\0A    float3 H = normalize(V + L);\0D\0A    \0D\0A    // If point light, calculate attenuation here;\0D\0A    float3 radiance = DrawInfoCB.SunColour; // * attenuation;\0D\0A\0D\0A    // Calculate Fersnel Term\0D\0A    float3 F = FresnelSchlick(saturate(dot(H, V)), F0);\0D\0A    \0D\0A    // Calculate Normal Distribution Term\0D\0A    float NDF = DistributionGGX(N, H, roughness);\0D\0A    \0D\0A    // Calculate Geometry Term\0D\0A    float G = GeometrySmith(N, V, L, roughness);\0D\0A    \0D\0A    // Now calculate Cook-Torrance BRDF\0D\0A    float3 numerator = NDF * G * F;\0D\0A    \0D\0A    // NOTE: we add 0.0001 to the denomiator to prevent a divide by zero in the case any dot product ends up zero\0D\0A    float denominator = 4.0 * saturate(dot(N, V)) * saturate(dot(N, L)) + 0.0001;\0D\0A\0D\0A    float3 specular = numerator / denominator;\0D\0A    \0D\0A    // Now we can calculate the light's constribution to the reflectance equation. Since Fersnel Value directly corresponds to\0D\0A    // Ks, we ca use F to denote the specular contribution of any light that hits the surface.\0D\0A    // we can now deduce what the diffuse contribution is as 1.0 = KSpecular + kDiffuse;\0D\0A    float3 kSpecular = F;\0D\0A    float3 KDiffuse = float3(1.0, 1.0, 1.0) - kSpecular;\0D\0A    KDiffuse *= 1.0f - metallic;\0D\0A    \0D\0A    float NdotL = saturate(dot(N, L));\0D\0A    Lo += (KDiffuse * albedo / PI + specular) * radiance * NdotL;\0D\0A    // -- End light iteration\0D\0A    \0D\0A    \0D\0A    // Improvised abmient lighting\0D\0A    float3 ambient = float3(0.03, 0.03, 0.03) * albedo * ao;\0D\0A    \0D\0A    float3 colour = ambient + Lo;\0D\0A    // Correction for gamma?\0D\0A    colour = colour / (colour + float3(1.0, 1.0, 1.0));\0D\0A    colour = pow(colour, float3(1.0 / 2.2, 1.0 / 2.2, 1.0 / 2.2));\0D\0A    \0D\0A    return float4(colour, 1.0f);\0D\0A}"}
