#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOUR                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; COLOUR                   0   xyzw        0     NONE   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; SV_Position              0   xyzw        2      POS   float   xyzw
;
; shader debug name: ad0ce0cb197f855b746e82cc26196788.pdb
; shader hash: ad0ce0cb197f855b746e82cc26196788
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOUR                   0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; COLOUR                   0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16)
!1 = !DIFile(filename: "D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CTexturedCubeVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !18, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VsOutput", file: !1, line: 16, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !20, file: !1, line: 18, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 19, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 20, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 9, size: 256, align: 32, elements: !33)
!33 = !{!34, !43, !44}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Pos", scope: !32, file: !1, line: 11, baseType: !35, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !32, file: !1, line: 12, baseType: !35, size: 96, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 13, baseType: !24, size: 64, align: 32, offset: 192)
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"dxc 1.2"}
!48 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CTexturedCubeVS.hlsl", !"\0D\0Astruct DrawInfo\0D\0A{\0D\0A    matrix modelViewProjectMatrix;\0D\0A};\0D\0A\0D\0AConstantBuffer<DrawInfo> DrawInfoCB : register(b1);\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 Pos      : POSITION;\0D\0A    float3 Colour   : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VsOutput\0D\0A{\0D\0A    float4 Colour : COLOUR;\0D\0A    float2 TexCoord : TEXCOORD;\0D\0A    float4 Position : SV_POSITION;\0D\0A};\0D\0A\0D\0AVsOutput main(VSInput input)\0D\0A{\0D\0A    VsOutput output;\0D\0A \0D\0A    output.Position = mul(DrawInfoCB.modelViewProjectMatrix, float4(input.Pos, 1.0f));\0D\0A    output.TexCoord = input.TexCoord;\0D\0A    output.Colour = float4(input.Colour, 1.0f);\0D\0A    \0D\0A    return output;\0D\0A}"}
!49 = !{!"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5CShaders\5CSrc\5CTexturedCubeVS.hlsl"}
!50 = !{!"/E", !"main", !"/T", !"vs_6_5", !"/Fo", !"D:\5CUsers\5CC.DiPaolo\5CDevelopment\5CGraphicsLearning-Dx12\5Cbuild\5Cx64\5CDebug\5CTexturedCubeVS.cso", !"/Zi", !"/Od", !"/Qembed_debug"}
!51 = !{i32 1, i32 5}
!52 = !{!"vs", i32 6, i32 5}
!53 = !{null, null, !54, null}
!54 = !{!55}
!55 = !{i32 0, %dx.alignment.legacy.DrawInfoCB* undef, !"DrawInfoCB", i32 0, i32 1, i32 1, i32 64, null}
!56 = !{i32 0, %struct.DrawInfo undef, !57, %struct.VsOutput undef, !60, %struct.VSInput undef, !64, %DrawInfoCB undef, !68, %dx.alignment.legacy.struct.DrawInfo undef, !57, %dx.alignment.legacy.DrawInfoCB undef, !68}
!57 = !{i32 64, !58}
!58 = !{i32 6, !"modelViewProjectMatrix", i32 2, !59, i32 3, i32 0, i32 7, i32 9}
!59 = !{i32 4, i32 4, i32 2}
!60 = !{i32 48, !61, !62, !63}
!61 = !{i32 6, !"Colour", i32 3, i32 0, i32 4, !"COLOUR", i32 7, i32 9}
!62 = !{i32 6, !"TexCoord", i32 3, i32 16, i32 4, !"TEXCOORD", i32 7, i32 9}
!63 = !{i32 6, !"Position", i32 3, i32 32, i32 4, !"SV_POSITION", i32 7, i32 9}
!64 = !{i32 40, !65, !66, !67}
!65 = !{i32 6, !"Pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!66 = !{i32 6, !"Colour", i32 3, i32 16, i32 4, !"COLOUR", i32 7, i32 9}
!67 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!68 = !{i32 64, !69}
!69 = !{i32 6, !"DrawInfoCB", i32 3, i32 0}
!70 = !{i32 1, void ()* @main, !71}
!71 = !{!72}
!72 = !{i32 0, !2, !2}
!73 = !{[12 x i32] [i32 10, i32 12, i32 3840, i32 3840, i32 3840, i32 0, i32 7, i32 7, i32 7, i32 0, i32 48, i32 48]}
!74 = !{void ()* @main, !"main", !75, !53, !88}
!75 = !{!76, !83, null}
!76 = !{!77, !80, !81}
!77 = !{i32 0, !"POSITION", i8 9, i8 0, !78, i8 0, i32 1, i8 3, i32 0, i8 0, !79}
!78 = !{i32 0}
!79 = !{i32 3, i32 7}
!80 = !{i32 1, !"COLOUR", i8 9, i8 0, !78, i8 0, i32 1, i8 3, i32 1, i8 0, !79}
!81 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !78, i8 0, i32 1, i8 2, i32 2, i8 0, !82}
!82 = !{i32 3, i32 3}
!83 = !{!84, !86, !87}
!84 = !{i32 0, !"COLOUR", i8 9, i8 0, !78, i8 2, i32 1, i8 4, i32 0, i8 0, !85}
!85 = !{i32 3, i32 15}
!86 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !78, i8 2, i32 1, i8 2, i32 1, i8 0, !82}
!87 = !{i32 2, !"SV_Position", i8 9, i8 3, !78, i8 4, i32 1, i8 4, i32 2, i8 0, !85}
!88 = !{i32 0, i64 1}
!89 = !DILocation(line: 23, column: 23, scope: !17)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 23, type: !32)
!91 = !DIExpression(DW_OP_bit_piece, 192, 64)
!92 = !DIExpression(DW_OP_bit_piece, 96, 96)
!93 = !DIExpression(DW_OP_bit_piece, 0, 96)
!94 = !DILocation(line: 27, column: 75, scope: !17)
!95 = !DILocation(line: 27, column: 38, scope: !17)
!96 = !DILocation(line: 27, column: 23, scope: !17)
!97 = !DILocation(line: 27, column: 21, scope: !17)
!98 = !DILocation(line: 28, column: 29, scope: !17)
